KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТКач_ОтчетПетлиСтраховочныеАрамидные/КАНАТКач_ОтчетПетлиСтраховочныеАрамидные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТКач_ОтчетПетлиСтраховочныеАрамидные</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов/КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов</name>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДПоказатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДляОтчета</name>
    <type>
      <types>EnumRef.КАНАТКач_ВидКачестваДляОтчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрОтчетов</name>
    <type>
      <types>EnumRef.КАНАТКач_ПараметрыОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТКач_ПараметрыОтчетов/КАНАТКач_ПараметрыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТКач_ПараметрыОтчетов</name>
  <enumValues>
    <name>ВиткиНа1м</name>
  </enumValues>
  <enumValues>
    <name>ВысотаПлетения</name>
  </enumValues>
  <enumValues>
    <name>Диаметр</name>
  </enumValues>
  <enumValues>
    <name>ДлинаКаната</name>
  </enumValues>
  <enumValues>
    <name>ДлинаПетли</name>
  </enumValues>
  <enumValues>
    <name>КВПоРазрывнойНагрузке</name>
  </enumValues>
  <enumValues>
    <name>КВПоШагуЯчеи</name>
  </enumValues>
  <enumValues>
    <name>КоличествоРывковДоРазрыва1</name>
  </enumValues>
  <enumValues>
    <name>КоличествоРывковДоРазрыва177</name>
  </enumValues>
  <enumValues>
    <name>КоэфУзлования</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCd</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCk</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCp</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCt</name>
  </enumValues>
  <enumValues>
    <name>ЛинейнаяПлотность</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка03</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка177</name>
  </enumValues>
  <enumValues>
    <name>Масса1м</name>
  </enumValues>
  <enumValues>
    <name>МассаОплетки</name>
  </enumValues>
  <enumValues>
    <name>МассаПетли</name>
  </enumValues>
  <enumValues>
    <name>МассаСердечника</name>
  </enumValues>
  <enumValues>
    <name>МассаСтропа</name>
  </enumValues>
  <enumValues>
    <name>НадежностьКрепленияКанатаL1</name>
  </enumValues>
  <enumValues>
    <name>НадежностьКрепленияКанатаL2</name>
  </enumValues>
  <enumValues>
    <name>НомЛинПлотностьНити</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноеУдлинениеПриНагрузке</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноеУдлинениеПриНагрузкеСГС</name>
  </enumValues>
  <enumValues>
    <name>ПодъемнаяПотопляющаяСила</name>
  </enumValues>
  <enumValues>
    <name>РабочаяДлинаСтропа</name>
  </enumValues>
  <enumValues>
    <name>РазрывнаяНагрузка</name>
  </enumValues>
  <enumValues>
    <name>РасходНиткиНаУзел</name>
  </enumValues>
  <enumValues>
    <name>СдвигОплетки</name>
  </enumValues>
  <enumValues>
    <name>УдельнаяРазрывнаяНагрузка</name>
  </enumValues>
  <enumValues>
    <name>Удлинение75</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПодНагрузкой50150</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПодНагрузкой80</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПриРазрыве</name>
  </enumValues>
  <enumValues>
    <name>Усадка</name>
  </enumValues>
  <enumValues>
    <name>УсадкаТехнологическая</name>
  </enumValues>
  <enumValues>
    <name>УстойчивостьВеревкиСУзлом8</name>
  </enumValues>
  <enumValues>
    <name>ФабричныйРазмерЯчеи</name>
  </enumValues>
  <enumValues>
    <name>ФактЛинПлотностьНитиMinMax</name>
  </enumValues>
  <enumValues>
    <name>ФактЛинПлотностьНитиСР</name>
  </enumValues>
  <enumValues>
    <name>ЧислоВитковНа1м</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка178</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТКач_ВидКачестваДляОтчета/КАНАТКач_ВидКачестваДляОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТКач_ВидКачестваДляОтчета</name>
  <enumValues>
    <name>Сетематериалы</name>
  </enumValues>
  <enumValues>
    <name>ВеревкиСтраховочноСпасательные</name>
  </enumValues>
  <enumValues>
    <name>КанатыДляЛазания</name>
  </enumValues>
  <enumValues>
    <name>ПетлиСтраховочныеТермостойкиеАрамидные</name>
  </enumValues>
  <enumValues>
    <name>СтропыГрузовыеСинтетическиеШнуровыеКольцевые</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
  <enumValues>
    <name>НитиППсЭкструзионнойЛинииSisol</name>
  </enumValues>
  <enumValues>
    <name>ПрочаяГотоваяПродукция</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/КАНАТ_РезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РезультатИспытаний</name>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НТДПродукции</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Структура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПартияГотовойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьФакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГотовойПродукцииИспытания</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаИМетодикаИспытаний</name>
    <type>
      <types>CatalogRef.КАНАТ_ПрограммаИМетодикаИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСырье</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СырьеДляПечатнойФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырья</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НТДСырья</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияСырья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПримечаниеПоСырью</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьВПФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТКач_ОтчетПетлиСтраховочныеАрамидные/ManagerModule.bsl
Функция ПараметрыСтолбцов()
	
	Результат = Новый Массив();
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВысотаПлетения);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ДлинаПетли);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаПетли);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ОтносительноеУдлинениеПриНагрузке);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляОтчета(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАНАТ_РезультатИспытаний.Продукция.Код КАК ПродукцияКод,
	               |	КАНАТ_РезультатИспытаний.Продукция.Наименование КАК ПродукцияНаименование,
	               |	КАНАТ_РезультатИспытаний.Цех КАК Цех,
	               |	КАНАТ_РезультатИспытаний.Оборудование КАК Оборудование,
	               |	КАНАТ_РезультатИспытаний.Влажность КАК Влажность,
	               |	КАНАТ_РезультатИспытаний.Результат КАК Результат,
	               |	ВложенныйЗапрос.Факт КАК Факт,
	               |	ВложенныйЗапрос.ПараметрОтчетов КАК ПараметрОтчетов,
	               |	КАНАТ_РезультатИспытаний.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Ссылка КАК Ссылка,
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Факт КАК Факт,
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов КАК ПараметрОтчетов
	               |		ИЗ
	               |			Документ.КАНАТ_РезультатИспытаний.РезультатИспытаний КАК КАНАТ_РезультатИспытанийРезультатИспытаний
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов КАК КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов
	               |				ПО КАНАТ_РезультатИспытанийРезультатИспытаний.Показатель = КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.Показатель
	               |		ГДЕ
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов В(&МассивПараметров)) КАК ВложенныйЗапрос
	               |		ПО КАНАТ_РезультатИспытаний.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытаний.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И КАНАТ_РезультатИспытаний.Продукция.КАНАТКач_ВидДляКонтроляКачества.ВидДляОтчета = &ВидДляОтчета
				   |	И КАНАТ_РезультатИспытаний.Проведен = Истина
	               |ИТОГИ
	               |	МАКСИМУМ(ПродукцияКод),
	               |	МАКСИМУМ(ПродукцияНаименование),
	               |	МАКСИМУМ(Цех),
	               |	МАКСИМУМ(Оборудование),
	               |	МАКСИМУМ(Влажность),
	               |	МАКСИМУМ(Результат)
	               |ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("МассивПараметров", ПараметрыСтолбцов());
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДляОтчета", Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);

	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);;
	
КонецФункции
